In [ ]:
# Manipulation of students data

In [2]:
import pandas as pd

female_names = pd.read_json("https://servicodados.ibge.gov.br/api/v1/censos/nomes/ranking?qtd=20&sexo=f")
male_names   = pd.read_json("https://servicodados.ibge.gov.br/api/v1/censos/nomes/ranking?qtd=20&sexo=m")

## .sample

In [3]:
female_names.sample(5)

       nome  regiao    freq  rank sexo
13    BRUNA       0  460770    14    F
19  MARIANA       0  381778    20    F
17  LUCIANA       0  429769    18    F
4   ADRIANA       0  565621     5    F
3   ANTONIA       0  588783     4    F

In [4]:
print(f'Number of names: {len(female_names) + len(male_names)}')

Number of names: 40

## .concat

In [17]:
frames = [female_names, male_names]

names = pd.concat(frames)['nome'].to_frame()

## Including studentsID and changing index

In [18]:
import numpy as np

In [20]:
# organizing index
names.index = range(names.shape[0])

# Creating studentsID variable
# np.random.permutation -> Create a random numbers in differents positions
names['studentsID'] = np.random.permutation(len(names)) + 1
names.head(5)

        nome  studentsID
0      MARIA           9
1        ANA          36
2  FRANCISCA          21
3    ANTONIA          32
4    ADRIANA          29

## Creating domain variable

In [26]:
domain = ['@domainemail.com.br', '@serviceemail.com']

# np.random.choice -> create data with a choice value
names['domain'] = np.random.choice(domain, len(names))
names.sample(5)

       nome  studentsID               domain                     email
26    PEDRO          23    @serviceemail.com  pedro@damailemail.com.br
19  MARIANA           7    @serviceemail.com  mariana@serviceemail.com
18  VANESSA          26  @domainemail.com.br  vanessa@serviceemail.com
14  JESSICA          24  @domainemail.com.br  jessica@serviceemail.com
31  GABRIEL           1    @serviceemail.com  gabriel@serviceemail.com

## Creating email variable

In [30]:
# .cat -> join two variables info
# .str -> it's necessary to transform the content into str

names['email'] = names['nome'].str.cat(names['domain']).str.lower()
names.head(5)

        nome  studentsID               domain                       email
0      MARIA           9  @domainemail.com.br    maria@domainemail.com.br
1        ANA          36    @serviceemail.com        ana@serviceemail.com
2  FRANCISCA          21    @serviceemail.com  francisca@serviceemail.com
3    ANTONIA          32    @serviceemail.com    antonia@serviceemail.com
4    ADRIANA          29  @domainemail.com.br  adriana@domainemail.com.br

## Exporting

In [32]:
names.to_json('data/students.json')